Tekla Open API Reference for Tekla Structures 2025
ParametricProfileItem.Select Method (String)
 Selects the parametric profile item in the profile database using the given name.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Select(
	string ProfileName
)
Public Function Select (
	ProfileName As String
) As Boolean
Parameters
ProfileName
Type: System.String
The name of the profile to select.
Return Value
Type: Boolean
True on success.
See Also
Reference
ParametricProfileItem Class
Select Overload
Tekla.Structures.Catalogs Namespace